solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpspi_cmsis.c
static ARM_SPI_STATUS LPSPI8_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI8_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI8 = {
    LPSPIx_GetVersion,     LPSPIx_GetCapabilities,
#if defined(RTE_SPI8_DMA_EN) && RTE_SPI8_DMA_EN
    LPSPI8_EdmaInitialize, LPSPI8_EdmaUninitialize, LPSPI8_EdmaPowerControl, LPSPI8_EdmaSend,     LPSPI8_EdmaReceive,
    LPSPI8_EdmaTransfer,   LPSPI8_EdmaGetCount,     LPSPI8_EdmaControl,      LPSPI8_EdmaGetStatus
#else
    LPSPI8_InterruptInitialize, LPSPI8_InterruptUninitialize, LPSPI8_InterruptPowerControl, LPSPI8_InterruptSend,
    LPSPI8_InterruptReceive,    LPSPI8_InterruptTransfer,     LPSPI8_InterruptGetCount,     LPSPI8_InterruptControl,
    LPSPI8_InterruptGetStatus
#endif
};

#endif /*  LPSPI8  */

#if defined(LPSPI9) && defined(RTE_SPI9) && RTE_SPI9

/* User needs to provide the implementation for LPSPI9_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI9_GetFreq(void);

static cmsis_lpspi_resource_t LPSPI9_Resource = {LPSPI9, 9, LPSPI9_GetFreq};

#if defined(RTE_SPI9_DMA_EN) && RTE_SPI9_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI9_EdmaResource = {
    RTE_SPI9_DMA_TX_DMA_BASE,    RTE_SPI9_DMA_TX_CH,          (uint16_t)RTE_SPI9_DMA_TX_PERI_SEL,
    RTE_SPI9_DMA_RX_DMA_BASE,    RTE_SPI9_DMA_RX_CH,          (uint16_t)RTE_SPI9_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI9_DMA_TX_DMAMUX_BASE, RTE_SPI9_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI9_EdmaHandle);
static edma_handle_t LPSPI9_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI9_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi9_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI9_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI9_EdmaDriverState = {
#endif
    &LPSPI9_Resource,
    &LPSPI9_EdmaResource,
    &LPSPI9_EdmaHandle,
    &LPSPI9_EdmaRxRegToRxDataHandle,
    &LPSPI9_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI9_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI9_PIN_INIT
    RTE_SPI9_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaUninitialize(void)
{
#ifdef RTE_SPI9_PIN_DEINIT
    RTE_SPI9_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI9_EdmaDriverState);
}

static uint32_t LPSPI9_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI9_EdmaDriverState);
}

static int32_t LPSPI9_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI9_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI9_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI9_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI9_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi9_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI9_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI9_InterruptDriverState = {
#endif
    &LPSPI9_Resource,
    &LPSPI9_Handle,
};

static int32_t LPSPI9_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI9_PIN_INIT
    RTE_SPI9_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptUninitialize(void)
{
#ifdef RTE_SPI9_PIN_DEINIT
    RTE_SPI9_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI9_InterruptDriverState);
}

static uint32_t LPSPI9_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI9_InterruptDriverState);
}

static int32_t LPSPI9_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI9_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI9_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI9_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI9 = {
    LPSPIx_GetVersion,     LPSPIx_GetCapabilities,
#if defined(RTE_SPI9_DMA_EN) && RTE_SPI9_DMA_EN
    LPSPI9_EdmaInitialize, LPSPI9_EdmaUninitialize, LPSPI9_EdmaPowerControl, LPSPI9_EdmaSend,     LPSPI9_EdmaReceive,
    LPSPI9_EdmaTransfer,   LPSPI9_EdmaGetCount,     LPSPI9_EdmaControl,      LPSPI9_EdmaGetStatus
#else
    LPSPI9_InterruptInitialize, LPSPI9_InterruptUninitialize, LPSPI9_InterruptPowerControl, LPSPI9_InterruptSend,
    LPSPI9_InterruptReceive,    LPSPI9_InterruptTransfer,     LPSPI9_InterruptGetCount,     LPSPI9_InterruptControl,
    LPSPI9_InterruptGetStatus
#endif
};

