solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpspi_cmsis.c
static ARM_SPI_STATUS LPSPI15_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI15_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI15 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI15_DMA_EN) && RTE_SPI15_DMA_EN
    LPSPI15_EdmaInitialize, LPSPI15_EdmaUninitialize, LPSPI15_EdmaPowerControl, LPSPI15_EdmaSend,
    LPSPI15_EdmaReceive,    LPSPI15_EdmaTransfer,     LPSPI15_EdmaGetCount,     LPSPI15_EdmaControl,
    LPSPI15_EdmaGetStatus
#else
    LPSPI15_InterruptInitialize, LPSPI15_InterruptUninitialize, LPSPI15_InterruptPowerControl, LPSPI15_InterruptSend,
    LPSPI15_InterruptReceive,    LPSPI15_InterruptTransfer,     LPSPI15_InterruptGetCount,     LPSPI15_InterruptControl,
    LPSPI15_InterruptGetStatus
#endif
};

#endif /*  LPSPI15  */

#if defined(LPSPI16) && defined(RTE_SPI16) && RTE_SPI16

/* User needs to provide the implementation for LPSPI16_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI16_GetFreq(void);

static cmsis_lpspi_resource_t LPSPI16_Resource = {LPSPI16, 16, LPSPI16_GetFreq};

#if defined(RTE_SPI16_DMA_EN) && RTE_SPI16_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI16_EdmaResource = {
    RTE_SPI16_DMA_TX_DMA_BASE,    RTE_SPI16_DMA_TX_CH,          (uint16_t)RTE_SPI16_DMA_TX_PERI_SEL,
    RTE_SPI16_DMA_RX_DMA_BASE,    RTE_SPI16_DMA_RX_CH,          (uint16_t)RTE_SPI16_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI16_DMA_TX_DMAMUX_BASE, RTE_SPI16_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI16_EdmaHandle);
static edma_handle_t LPSPI16_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI16_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi16_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI16_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI16_EdmaDriverState = {
#endif
    &LPSPI16_Resource,
    &LPSPI16_EdmaResource,
    &LPSPI16_EdmaHandle,
    &LPSPI16_EdmaRxRegToRxDataHandle,
    &LPSPI16_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI16_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI16_PIN_INIT
    RTE_SPI16_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaUninitialize(void)
{
#ifdef RTE_SPI16_PIN_DEINIT
    RTE_SPI16_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI16_EdmaDriverState);
}

static uint32_t LPSPI16_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI16_EdmaDriverState);
}

static int32_t LPSPI16_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI16_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI16_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI16_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI16_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi16_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI16_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI16_InterruptDriverState = {
#endif
    &LPSPI16_Resource,
    &LPSPI16_Handle,
};

static int32_t LPSPI16_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI16_PIN_INIT
    RTE_SPI16_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptUninitialize(void)
{
#ifdef RTE_SPI16_PIN_DEINIT
    RTE_SPI16_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI16_InterruptDriverState);
}

static uint32_t LPSPI16_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI16_InterruptDriverState);
}

static int32_t LPSPI16_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI16_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI16_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI16_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI16 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI16_DMA_EN) && RTE_SPI16_DMA_EN
    LPSPI16_EdmaInitialize, LPSPI16_EdmaUninitialize, LPSPI16_EdmaPowerControl, LPSPI16_EdmaSend,
    LPSPI16_EdmaReceive,    LPSPI16_EdmaTransfer,     LPSPI16_EdmaGetCount,     LPSPI16_EdmaControl,
    LPSPI16_EdmaGetStatus
#else
    LPSPI16_InterruptInitialize, LPSPI16_InterruptUninitialize, LPSPI16_InterruptPowerControl, LPSPI16_InterruptSend,
    LPSPI16_InterruptReceive,    LPSPI16_InterruptTransfer,     LPSPI16_InterruptGetCount,     LPSPI16_InterruptControl,
    LPSPI16_InterruptGetStatus
#endif
};

#endif /*  LPSPI16  */

