solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI20_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI20_EdmaDriverState);
}

static uint32_t LPSPI20_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI20_EdmaDriverState);
}

static int32_t LPSPI20_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI20_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI20_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI20_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI20_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi20_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI20_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI20_InterruptDriverState = {
#endif
    &LPSPI20_Resource,
    &LPSPI20_Handle,
};

static int32_t LPSPI20_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI20_PIN_INIT
    RTE_SPI20_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptUninitialize(void)
{
#ifdef RTE_SPI20_PIN_DEINIT
    RTE_SPI20_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI20_InterruptDriverState);
}

static uint32_t LPSPI20_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI20_InterruptDriverState);
}

static int32_t LPSPI20_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI20_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI20_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI20_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI20 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI20_DMA_EN) && RTE_SPI20_DMA_EN
    LPSPI20_EdmaInitialize, LPSPI20_EdmaUninitialize, LPSPI20_EdmaPowerControl, LPSPI20_EdmaSend,
    LPSPI20_EdmaReceive,    LPSPI20_EdmaTransfer,     LPSPI20_EdmaGetCount,     LPSPI20_EdmaControl,
    LPSPI20_EdmaGetStatus
#else
    LPSPI20_InterruptInitialize, LPSPI20_InterruptUninitialize, LPSPI20_InterruptPowerControl, LPSPI20_InterruptSend,
    LPSPI20_InterruptReceive,    LPSPI20_InterruptTransfer,     LPSPI20_InterruptGetCount,     LPSPI20_InterruptControl,
    LPSPI20_InterruptGetStatus
#endif
};

#endif /*  LPSPI20  */
